# 6. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
#
# Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.

# start_km_first_day = float(input("Сколько километров вы пробежали за первый день: "))
# result = float(input("Введите общий релультат к которому вы стремитесь: "))

start_km_first_day = 10
result = 16.2
count = 1
result_day = ""
print("Результат:")
while True:
    percent_km = (start_km_first_day * 10) / 100
    start_km_first_day = float('{:.2f}'.format(start_km_first_day + percent_km))
    print(f"{count}-й день: {start_km_first_day} км.")
    if start_km_first_day > result:
        result_day = f"\nОтвет: на {count}-й день спортсмен достиг результата не менее {result} км."
        print(result_day)
        break

    count += 1
