# 5. Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

# revenue = float(input("Введите значение выручки: "))
# cost = float(input("Введите значение издержки: "))
revenue = 31321213.33
cost = 3321233.2

profitability = 0.00
if revenue > cost:
    print("Фирма работает прибыльно.")
    profit = revenue - cost
    profitability = profit / revenue
    # count_personnel = int(input("Введите численность сотрудников фирмы: "))
    count_personnel = 343
    profit_one_persona = profit / count_personnel
    print(
        f"Чистая прибыль: {profit}\n"
        f"Рентабельность: {profitability}\n"
        f"Чистая прибыль на одного сотрудника:{profit_one_persona}.")
elif cost - revenue:
    print("Фирма работает в убыток.")
