# 6. *Реализовать структуру данных «Товары».
# Она должна представлять собой список кортежей.
# Каждый кортеж хранит информацию об отдельном товаре.
# В кортеже должно быть два элемента — номер товара и словарь с параметрами
# (характеристиками товара: название, цена, количество, единица измерения).
# Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
# Пример готовой структуры:
# [
# (1, {"название": "компьютер", "цена": 20000, "количество": 5, "eд": "шт."}),
# (2, {"название": "принтер", "цена": 6000, "количество": 2, "eд": "шт."}),
# (3, {"название": "сканер", "цена": 2000, "количество": 7, "eд": "шт."})
# ]
# Необходимо собрать аналитику о товарах. Реализовать словарь,
# в котором каждый ключ — характеристика товара, например название,
# а значение — список значений-характеристик, например список названий товаров.
# Пример:
# {
# "название": ["компьютер", "принтер", "сканер"],
# "цена": [20000, 6000, 2000],
# "количество": [5, 2, 7],
# "ед": ["шт."]
# }


# My params user
# products = []
#
# # count_products = int(input("Сколько вы хотите ввести товаров?: "))
# count_products = 3
#
# for item in range(count_products):
#     name = input("Введите название: ")
#     price = float(input("Введите цену: "))
#     count = int(input("Введите количество: "))
#     ed = input("Введите еденицу измерения: ")
#     len_product = len(products)
#     len_product += 1
#     product_dict = {"название": name, "цена": price, "количество": count, "ед": ed}
#     product = (len_product, product_dict)
#     products.append(product)
#     print("товар добавлен")


products = [(1, {'название': 'test', 'цена': 232.0, 'количество': 2, 'ед': 'шт.'}),
            (2, {'название': 'test2', 'цена': 555.0, 'количество': 3, 'ед': 'шт.'}),
            (3, {'название': 'sads', 'цена': 3333.0, 'количество': 45, 'ед': 'шт.'})]

analytics = {
    'название': [],
    'цена': [],
    'количество': [],
    'ед': [],
}

for item in products:
    product = dict(item[-1])
    for key, val in product.items():
        if key == "название":
            analytics["название"].append(val)
        elif key == "цена":
            analytics["цена"].append(val)
        elif key == "количество":
            analytics["количество"].append(val)
        elif key == "ед" and val not in analytics["ед"]:
            analytics["ед"].append(val)

print(analytics)
