# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y.
# Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


# first_variant realization
def my_func_1(x, y):
    return x ** y


# two_variant realization
def my_func_2(x, y):
    result = x
    for iteration in range(1, y):
        result *= x
    return result


number = 5
power = 3

print(my_func_1(number, power))
print(my_func_2(number, power))
