# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.


def print_user_information(name, last_name, birthday, city, email, phone):
    print(
        f"Имя: {name}, Фамилия: {last_name}, дата рождения: {birthday}, "
        f"Город проживания: {city}, емейл: {email}, телефон: {phone}")


print_user_information(last_name="Пузякин", name="Вася", birthday="23.02.1905", city="Москва", email="test@ts.as",
                       phone="21111111111")
