# 3. Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка.
# В его конструкторе инициализировать параметр, соответствующий количеству клеток (целое число).
# В классе должны быть реализованы методы перегрузки арифметических операторов:
# сложение (add()), вычитание (sub()), умножение (mul()), деление (truediv()).
# Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение,
# умножение и обычное (не целочисленное) деление клеток, соответственно.
# В методе деления должно осуществляться округление значения до целого числа.
# Сложение. Объединение двух клеток.
# При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
# Вычитание. Участвуют две клетки.
# Операцию необходимо выполнять только если разность количества ячеек двух клеток больше нуля,
# иначе выводить соответствующее сообщение.
# Умножение. Создается общая клетка из двух.
# Число ячеек общей клетки определяется как произведение количества ячеек этих двух клеток.
# Деление. Создается общая клетка из двух.
# Число ячеек общей клетки определяется как целочисленное деление количества ячеек этих двух клеток.

# В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду.
# Данный метод позволяет организовать ячейки по рядам.
# Метод должен возвращать строку вида **\n\n***..., где количество ячеек между \n равно переданному аргументу.
# Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
# Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5.
# Тогда метод make_order() вернет строку: **\n\n.
# Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5.
# Тогда метод make_order() вернет строку: **\n\n***.


def make_order(cage_obj, count_row):
    pass


class Cage:
    def __init__(self, number):
        self.number = number

    def __add__(self, other):
        result = Cage(None)
        result.number = int(self.number + other.number)
        return result

    def __sub__(self, other):
        result = Cage(None)
        if other.number > 0:
            result.number = int(self.number - other.number)
        else:
            result.number = self.number
        return result

    def __mul__(self, other):
        result = Cage(None)
        result.number = round(self.number * other.number)
        return result

    def __truediv__(self, other):
        result = Cage(None)
        result.number = round(self.number / other.number)
        return result

    def __str__(self):
        return f"{self.number}"


if __name__ == "__main__":
    one = Cage(10)
    two = Cage(1)
    three = Cage(3)

    c = (one - two) * three
    print(c)
